var num1 = 6; 
var num2 = 7;
res = num1 + num2;

console.log("Result is: " + res); 



var num3 = 7;
num3--; /*num3-- - БІзге берілген переменныйдан 1 ді алып тастайды. Сонда жауабы 6 деп шығады.*/
num3++;  /*num3 ++ - Бізге берілген переменныйға 1 ді қосады. Сонда жауабы 7 шығады.*/

/*var - переменныйын өзгертуге болады. Біз сол переменныйдын значениесін өзгертіп жатырмыз.*/

console.log(num3);



var str1 = "52";  /*переменнaя str1 в нем есть значение 52 в скобках*/
var str2 = "45";  /*переменнaя str2 в нем есть значение 45 в скобках*/
res = str1 + str2;

console.log("The result is: " + res)  /*Екі переменныйды қоссақ бұл жерде математикалық амал орындалмайды. Өйткені берілген массивтің ішіндегі
сан тырнақшаға алынған. Егер значение тырнақшаға алынса онда ішіндегі значение текстовый деп оқылады.*/

/*Результатында жауап: 5245 болып шығады*/


 
